[LWS_Buccaneer X2SoldierClassTemplate]
+DisplayName="Buccaneer"
+ClassSummary="Buccaneers are dedicated close combat soldiers wielding a sword and sawed-off shotgun combo. They specialize in securing kills with their powerful action economy and ability to easily recover sawed-off shotgun ammo in the field."
+LeftAbilityTreeTitle="Swordplay"
+RightAbilityTreeTitle="Rock The Boat"
AbilityTreeTitles[0]="Swordplay"
AbilityTreeTitles[1]="Blunderbuss"
AbilityTreeTitles[2]="Rock The Boat"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="Pistols"

+RandomNickNames[0]="First Mate"
+RandomNickNames[1]="Crossbone"
+RandomNickNames[2]="Cutthroat"
+RandomNickNames[3]="Outlaw"
+RandomNickNames[4]="Menace"
+RandomNickNames[5]="Buckshot"
+RandomNickNames[6]="Somalia"
+RandomNickNames[7]="Jackknife"
+RandomNickNames[8]="Matey"
+RandomNickNames[9]="Sparrow"
+RandomNickNames[10]="Scourge"
+RandomNickNames[11]="Orca"
+RandomNickNames[12]="Treasurer"
+RandomNickNames[13]="Osprey"
+RandomNickNames[14]="Kraken"
+RandomNickNames[15]="Hammerhead"
+RandomNickNames[16]="Plunderer"
+RandomNickNames[17]="Scurvy"
+RandomNickNames[18]="High Seas"
+RandomNickNames[19]="Boarder"
+RandomNickNames[20]="Sabre"
+RandomNickNames[21]="Hook"
+RandomNickNames[22]="Avast"
+RandomNickNames[23]="Flintlock"
+RandomNickNames[24]="Grand Blue"
+RandomNickNames[25]="Salty Dog"
+RandomNickNames[26]="Tampa Bay"